; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v5 - type_1)
 	      (pred_3 ?v1 - object ?v5 - type_1)
	      (pred_1 ?v2 - type_3 ?v6 - type_2)
	      (pred_4 ?v2 - type_3 ?v1 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v2 - type_3 ?v8 ?v7 - type_1)
       :precondition (and  (pred_2 ?v2 ?v8))
       :effect (and  (pred_2 ?v2 ?v7)
		     (not (pred_2 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_3 ?v3 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v4) (pred_2 ?v2 ?v4) (pred_1 ?v2 ?v6))
       :effect (and (pred_4 ?v2 ?v3 ?v6)
		    (not (pred_3 ?v3 ?v4)) 
		    (not (pred_1 ?v2 ?v6))))

   (:action op_1
       :parameters (?v2 - type_3 ?v3 - object ?v4 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v3 ?v6) (pred_2 ?v2 ?v4))
       :effect (and (pred_3 ?v3 ?v4)
		    (pred_1 ?v2 ?v6)
		    (not (pred_4 ?v2 ?v3 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_04 - type_3
obj_05 obj_09 obj_10 obj_07 - type_2
obj_12 obj_01 obj_08 - type_1
obj_03 obj_11 obj_02 - object)
(:init
(pred_2 obj_06 obj_01)
(pred_1 obj_06 obj_05)
(pred_1 obj_06 obj_09)
(pred_2 obj_04 obj_08)
(pred_1 obj_04 obj_10)
(pred_1 obj_04 obj_07)
(pred_3 obj_03 obj_12)
(pred_3 obj_11 obj_01)
(pred_3 obj_02 obj_12)
)
(:goal
(and
(pred_3 obj_03 obj_08)
(pred_3 obj_11 obj_01)
(pred_3 obj_02 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_06 obj_08) (pred_2 obj_04 obj_08))))
  )
)
)

; plan
1. (op_3 obj_06 obj_01 obj_12)
   deleted: (pred_2 obj_06 obj_01)
   added: (pred_2 obj_06 obj_12)
   goals met: 2 of 3
2. (op_3 obj_04 obj_08 obj_12)
   deleted: (pred_2 obj_04 obj_08)
   added: (pred_2 obj_04 obj_12)
   goals met: 2 of 3
3. (op_2 obj_06 obj_03 obj_12 obj_09)
   deleted: (pred_3 obj_03 obj_12) (pred_1 obj_06 obj_09)
   added: (pred_4 obj_06 obj_03 obj_09)
   goals met: 2 of 3
4. (op_3 obj_06 obj_12 obj_08)
   deleted: (pred_2 obj_06 obj_12)
   added: (pred_2 obj_06 obj_08)
   goals met: 2 of 3
5. (op_1 obj_06 obj_03 obj_08 obj_09)
   deleted: (pred_4 obj_06 obj_03 obj_09)
   added: (pred_3 obj_03 obj_08) (pred_1 obj_06 obj_09)
   goals met: 3 of 3
